{
  "meta": { "theme": "stackoverflow" },
  	"basics": {
    	"name": "Nachiappan Palaniappan",
    	"label": "Devops Engineer",
    	"image": "https://scontent.fmaa1-1.fna.fbcdn.net/v/t1.0-9/18033227_1313330722069569_3470150836329416229_n.jpg?_nc_cat=110&_nc_sid=09cbfe&_nc_oc=AQnprgU8ZH_sKzDDqNlPu_JdxYZp8ELwi7cJxHlwAerGAiWfJcgbdgT_MRkwn8PsUWB9vBYyOJ1e4owUuNoqau4C&_nc_ht=scontent.fmaa1-1.fna&oh=f4772d21b979d94938c5fb99331fa763&oe=5EF4BAA3",
	"summary": " Working with DXC Technologies Pvt Ltd with 1.2 Years of IT experience including 2+ Years of hands on Experience in DevOps, Experience in using Integration tools like Jenkins for CI/CD Pipelining and proficient understanding of Distributed versioning tools (Git & Github), Experience in using Integrated Development Environments (IDE) like Jenkins & kubernetes, Experience in using a wide variety of open source technologies and tools, Experience in maintaining the quality standards of both Client and Employe",
"email": "pl.ganeshh@gmail.com",
    "location": {
      "city": "Bangalore, Karnataka.",
      "Country": "India"
    },
    "profiles": [
      {
        "username": "Nachiappan Palaniappan",
        "url": "www.linkedin.com/in/nachiappan-palaniappan-93015b92",
        "network": "LinkedIn"
      },
      {
        "url": "https://github.com/Nachiappan93",
        "username": "Nachiappan93",
        "network": "Github"
      }
    ]
  },

  "work": [
    {
      "company": "DXC Technologies",
      "position": "Professional System Administrator",
      "website": "https://www.dxc.technology.com/",
      "startDate": "2019-04-29",
      "summary": "DXC Technology helps our customers across the entire enterprise technology stack with differentiated industry solutions. We modernize IT, optimize data architectures, and make everything secure, scalable and orchestrated across public, private and hybrid clouds.",
      "highlights": [
        "Project: SAP Germany", 
	"Environment: Linux, GIT, Jenkins, Ansible (Configuration)",

	"Worked on IAM, created roles, groups for the users on the same environment of AWS. ",
	"Creating CI/CD pipelines by integrating Git, Jenkins, Ansible, AWS and Docker ",
	"Used CATLIGHT for notification& monitoring purpose for Jenkins ",
	"Serves a primary point responsible for the overall health, performance, and capacity of one or more of our Internet-facing services. ",
	"Good Knowledge with Integration tools like JENKINS to implement the End-to-End Automation.",
	"Worked on infrastructure with Ansible, collaborated with development support teams to setup a continuous delivery environment with the help of Ansible. Creating/modifying users using Ansible Playbook",
	"Deploying source code from Github."
	]
    },
    {
      "company": "CGI",
      "position": "Associate System Engineer",
      "website": "hhttps://www.cgi.com/",
      "startDate": "2017-05-27",
      "endDate": "2019-04-26",
      "summary": "CGI is among the largest IT and business consulting services firms in the world. Operating in hundreds of locations across the globe, CGI delivers end-to-end services and solutions, including strategic IT and business consulting, systems integration, intellectual property, and managed IT and business process services.",
      "highlights": [
        "Serves a primary point responsible for the overall health, performance, and capacity of one or more of our Internet-facing services.",
	"Working closely with development teams to ensure that solutions are designed with customer user experience, scale/performance and operable in mind.",
	"Investigating and evaluating the new tools and DevOps technologies. ",
	"Performed routine management of Linux environment like monitoring Disk Space and CPU Utilization through shell scripts.  Coordinating with the Development team to fix the Build related issues."

      ]
    },
    {
      "company": "Vectone Mobile",
      "position": "Network support engineer",
      "startDate": "2016-02-10",
      "endDate": "2017-02-10",
      "summary": "Vectone Mobile, the UK’s first full MVNO (Mobile Virtual Network Operator).",
      "highlights": [
        "Fixing bugs for the existing functionalities in the application.",
	"Enhanced many Shell scripts to improve the application performance ",
	"In Managing Disk, File Systems, Server Performance, Users Creation and Granting file access Permissions. Troubleshooting with start/stop of daemons/Services. Hands on experience Disable and Enabling the Service "
      ]
    }
  ],
  "education": [
    {
      "institution": "Anna University",
      "area": "Computer Science and Engineering",
      "studyType": "Bachelor",
      "startDate": "2011-04-01",
      "endDate": "2015-05-01",
      "gpa": "",
      "courses": [
      ]
    }
  ],
  "skills": [
    {
      "name": "Cloud",
      "keywords": [
        "AWS",
        "CI & CD Pipelines",
	      "Jenkins",
	      "Github",
      	"Kubernetes",
	"Ansible",
	"Linux"
      ]
    }
      ]
}
